import React from 'react';
import {Link} from 'react-router-dom';

function PrivacyPolicyPage() {
  return (
    <div className='privacy-policy-page'>
      <div className='privacy-policy-page__btn-back-wrapper'>
        <Link to='/'>
          <button className='cart__empty-btn-back'>
                Вернуться на главную
          </button>
        </Link>
      </div>
      <div className='privacy-policy-page__text'>
        <h1 className='privacy-policy-page__title'>
          ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
        </h1>
        <p>
          <strong>ОСНОВНОЕ</strong>
        </p>

        <p>
          Настоящая Политика конфиденциальности
          персональных данных (далее - Политика
          конфиденциальности); действует в
          отношении всей информации, размещенной на сайте в сети Интернет,
          которая оставляется Пользователем во время
          использования Сайта.
        </p>

        <p>
          Мы собираем персональные данные («информацию»), которую получаем
          от вас по электронной почте и из регистрационных анкет, которые
          вы заполняете, на Сайте.
        </p>

        <p>
          Информация собирается, когда вы добровольно проходите опрос,
          в котором мы приглашаем вас принять участие, или когда вы оставляете
          отзыв, комментарий или другую информацию на нашем Сайте.
        </p>

        <p>
          Если процесс регистрации не был успешно завершен, мы не сохраняем
          информацию, касающуюся вас, за исключением ограниченного объема
          информации, необходимой для предотвращения мошенничества или
          неправомерного использования.
        </p>

        <p>
          Использование сервисов Сайта означает безоговорочное согласие
          Пользователя с настоящей Политикой и указанными в ней условиями
          обработки его персональной информации; в случае несогласия с этими
          условиями Пользователь должен воздержаться от использования Сайта.
        </p>

        <p>&nbsp;</p>

        <p><strong>1. ОБЩИЕ ПОЛОЖЕНИЯ</strong></p>

        <p>
          1.1. В рамках настоящей Политики под персональной информацией
          Пользователя понимаются:
        </p>

        <p>
          1.1.1. Персональная информация, которую Пользователь предоставляет
          о себе самостоятельно в процессе использования Сайта, включая
          персональные данные Пользователя. Обязательная для предоставления
          Сервисов информация помечена специальным образом. Иная информация
          предоставляется Пользователем на его усмотрение.
        </p>

        <p>
          1.1.2. Данные, которые автоматически передаются сервисам Сайта в
          процессе их использования с помощью установленного на устройстве
          Пользователя программного обеспечения, в том числе IP-адрес, данные
          файлов cookie, информация о браузере Пользователя (или иной программе,
          с помощью которой осуществляется доступ к сервисам), технические
          характеристики оборудования и программного обеспечения, используемых
          Пользователем, дата и время доступа к сервисам, адреса запрашиваемых
          страниц и иная подобная информация.
        </p>

        <p>
          1.2.<strong>Какая Информацию о Пользователе собирается.</strong>
        </p>

        <p>
          По настоящей Политики конфиденциальности собирается информация,
          полученная в процессе работы Сайта.
        </p>

        <p>
          В тех случаях, когда осуществляется вход в систему, через проверку
          номера телефона, ранее зарегистрированного в Сервисах оператора
          Сайта, Персональная информация, собранная о Пользователе во время
          использования Сайта и Сервисов, может быть сопоставлена и связана
          с другой Персональной информацией, если она (Информация) была
          предоставлена оператору Сайта.
        </p>

        <p>
          Собираться следующая категория Персональной информации о Пользователе:
        </p>

        <p>
          1.2.1.Персональная информация, предоставленная Пользователем,
          а именно номер телефона;
        </p>

        <p>
          1.2.3. Электронные данные (HTTP-заголовки, IP-адрес, файлы
          cookie, веб-маяки/пиксельные теги, данные об идентификаторе
          браузера, информация об аппаратном и программном обеспечении);
        </p>

        <p>
          1.2.3. Дата и время осуществления доступа к Сайту;
        </p>

        <p>
          1.2.5. Информация о Вашей активности во время использования Сайтов;
        </p>

        <p>
          1.2.6. Информация о геолокации;
        </p>

        <p>
          1.2.7. Информация о Пользователе, которую оператор Сайта получает
          от Партнеров в соответствии с условиями соглашений, заключенных между
          Пользователем и соответствующим Партнером, и соглашений, заключенных
          между оператором Сайта и Партнером.
        </p>

        <p>
          Также оператор Сайта использует файлы cookie и веб-маяки (включая
          пиксельные теги) для сбора Персональной информации и связывания такой
          личной информации с устройством Пользователя и веб-браузером.
        </p>

        <p>
          <strong>
            2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
          </strong>
        </p>

        <p>
          2.1. Сайт собирает и хранит только ту персональную информацию,
          которая необходима для предоставления сервиса на Сайте, за исключением
          случаев, когда законодательством предусмотрено обязательное хранение
          персональной информации в течение определенного законом срока.
        </p>

        <p>
          2.2. Персональную информацию Пользователя Сайт обрабатывает
          в следующих целях:
        </p>

        <p>
          2.2.1. Идентификации Пользователя.
        </p>

        <p>
          2.2.2. Предоставления Пользователю доступа к персонализированным
          ресурсам Сайта.
        </p>

        <p>
          2.2.3. Установления с Пользователем обратной связи, включая
          направление уведомлений, запросов, касающихся использования Сайта.
        </p>

        <p>
          2.2.4. Определения места нахождения Пользователя для обеспечения
          безопасности, предотвращения мошенничества.
        </p>

        <p>
          2.2.5. Подтверждения достоверности и полноты персональных данных,
          предоставленных Пользователем.
        </p>

        <p>
          2.2.7. Уведомления Пользователя Сайта о совершении и/или не
          совершении действий на Сайте.
        </p>

        <p>&nbsp;</p>

        <p>
          <strong>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
            И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ
          </strong>
        </p>

        <p>
          3.1. Сайт хранит персональную информацию Пользователей в соответствии
          с внутренними регламентами конкретных сервисов, исполнение которых
          необходимо для работы Сайта.
        </p>

        <p>
          3.2. В отношении персональной информации Пользователя сохраняется ее
          конфиденциальность, кроме случаев добровольного предоставления
          Пользователем информации о себе для общего доступа неограниченному
          кругу лиц. При использовании отдельных сервисов Пользователь
          соглашается с тем, что определенная часть его персональной информации
          становится общедоступной.
        </p>

        <p>
          3.3. Сайт вправе передать персональную информацию Пользователя третьим
          лицам в следующих случаях:
        </p>

        <p>3.3.1. Пользователь выразил согласие на такие действия.</p>

        <p>
          3.3.2. Передача необходима для использования Пользователем
          определенного сервиса либо для исполнения определенного соглашения
          или договора с Пользователем.
        </p>

        <p>
          3.3.4. Передача предусмотрена российским или иным применимым
          законодательством в рамках установленной законодательством процедуры.
        </p>

        <p>
          3.3.5. В случае продажи Сайта к приобретателю переходят все
          обязательства по соблюдению условий настоящей Политики применительно
          к полученной им персональной информации.
        </p>

        <p>
          3.4. Обработка персональных данных Пользователя осуществляется без
          ограничения срока любым законным способом, в том числе в
          информационных системах персональных данных с использованием средств
          автоматизации или без использования таких средств. Обработка
          персональных данных Пользователей осуществляется в соответствии с
          Федеральным законом от 27.07.2006 №152-ФЗ «О персональных данных.
        </p>

        <p>
          3.5. При утрате или разглашении персональных данных Администрация
          Сайта информирует Пользователя об утрате или разглашении
          персональных данных.
        </p>

        <p>
          3.6. Администрация Сайта принимает необходимые организационные и
          технические меры для защиты персональной информации Пользователя от
          неправомерного или случайного доступа, уничтожения, изменения,
          блокирования, копирования, распространения, а также от иных
          неправомерных действий третьих лиц.
        </p>

        <p>
          3.7. Администрация Сайта совместно с Пользователем принимает все
          необходимые меры по предотвращению убытков или иных отрицательных
          последствий, вызванных утратой или разглашением персональных данных
          Пользователя.
        </p>

        <p>&nbsp;</p>

        <p>
          <strong>4. ОБЯЗАТЕЛЬСТВА СТОРОН</strong>
        </p>

        <p>4.1. Пользователь обязан:</p>

        <p>
          4.1.1. Предоставить информацию о персональных данных, необходимую
          для пользования Сайтом.
        </p>

        <p>
          4.2. Администрация Сайта обязана:

        </p>

        <p>
          4.2.1. Использовать полученную информацию исключительно для целей,
          указанных в настоящей Политике конфиденциальности.
        </p>

        <p>
          4.2.2. Обеспечить хранение конфиденциальной информации в тайне,
          не разглашать без предварительного письменного разрешения
          Пользователя, а также не осуществлять продажу, обмен, опубликование
          либо разглашение иными возможными способами переданных персональных
          данных Пользователя, за исключением предусмотренных настоящей
          Политикой конфиденциальности.
        </p>

        <p>
          4.2.3. Принимать меры предосторожности для защиты конфиденциальности
          персональных данных Пользователя согласно порядку, обычно
          используемому для защиты такого рода информации в существующем
          деловом обороте.
        </p>

        <p>
          4.2.4. Осуществить блокирование персональных данных, относящихся к
          соответствующему Пользователю, с момента обращения или запроса
          Пользователя или его законного представителя либо уполномоченного
          органа по защите прав субъектов персональных данных на период проверки
          в случае выявления недостоверных персональных данных или неправомерных
          действий.
        </p>

        <p>&nbsp;</p>

        <p>
          <strong>5. ОТВЕТСТВЕННОСТЬ СТОРОН</strong>
        </p>

        <p>
          5.1. В случае утраты или разглашения конфиденциальной информации
          Администрация Сайта не несет ответственности, если данная
          конфиденциальная информация:
        </p>

        <p>
          5.1.1. Стала публичным достоянием до ее утраты или разглашения.

        </p>

        <p>
          5.1.2. Была получена от третьей стороны до момента ее получения
          Администрацией Сайта.
        </p>

        <p>
          5.1.3. Была разглашена с согласия Пользователя.
        </p>

        <p>&nbsp;</p>

        <p>
          <strong>6. РАЗРЕШЕНИЕ СПОРОВ</strong>
        </p>

        <p>
          6.1. До обращения в суд с иском по спорам, возникающим из отношений
          между Пользователем Сайта и Администрацией Сайта, обязательным
          является предъявление претензии (письменного предложения о
          добровольном урегулировании спора).
        </p>

        <p>
          6.2. Получатель претензии в течение 30 календарных дней со дня
          получения претензии письменно уведомляет заявителя претензии о
          результатах рассмотрения претензии.
        </p>

        <p>
          6.3. При недостижении соглашения спор будет передан на рассмотрение
          в суд в соответствии с действующим законодательством
          Российской Федерации.
        </p>

        <p>
          6.4. К настоящей Политике конфиденциальности и отношениям между
          Пользователем и Администрацией Сайта применяется действующее
          законодательство Российской Федерации.
        </p>

        <p>&nbsp;</p>

        <p><strong>7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</strong></p>

        <p>
          7.1. Администрация Сайта вправе вносить изменения в настоящую
          Политику конфиденциальности без согласия Пользователя.
        </p>

        <p>
          7.2. Новая Политика конфиденциальности вступает в силу с
          момента ее размещения на Сайте, если иное не предусмотрено
          новой редакцией Политики конфиденциальности.
        </p>

        <p>
          7.3. Все предложения или вопросы по настоящей Политике
          конфиденциальности следует сообщать office@example.ru.
        </p>
      </div>
      <div className='privacy-policy-page__btn-back-wrapper'>
        <Link to='/'>
          <button className='cart__empty-btn-back'>
                Вернуться на главную
          </button>
        </Link>
      </div>
    </div>
  );
}

export default PrivacyPolicyPage;
