import React from 'react';

function PublicOfferPage() {
  return (
    <div className='public-offer-page'>
      <div className='public-offer-page__low-text'>
        <h1 className='public-offer-page__title'>ПУБЛИЧНАЯ ОФЕРТА</h1>
        <p>
          <strong>Термины и определения</strong><br/>
          <br/>
            В настоящей оферте, если из контекста не следует иное,
            нижеприведенныетермины имеют следующие значения и являются
            её составной неотъемлемойчастью:<br/>
          <br/>
          <strong>Продавец, Оператор</strong>
          &nbsp;— юридическое лицо, ИП Иванов И.И., местонахождение по адресу:
          <strong>&nbsp;</strong>
            999999,РОССИЯ, НЕБЫВАЛЬСКАЯ ОБЛ., НЕБЫВАЛЬСК Г.,
            ФЕДЮНИНСКОГО УЛ.32/2, КВАРТИРА 1125, созданное в
            соответствии c законодательством Российской Федерации
            и осуществляющее предпринимательскую
            деятельность по продаже Товаров, в том числе дистанционным
            способом.<br/>
          <br/>
          <strong>Покупатель, Пользователь</strong>
            &nbsp;— любое физическое лицо, принявшее (акцептировавшее) настоящую
            оферту на нижеуказанных условиях и предоставившее Продавцу свои
            персональные данные посредством оформления Заказа Покупателя на
            Сайте,которые могут быть использованы Продавцом для выполнения
            Заказа Покупателя.<br/>
          <br/>
          <strong>Продавец, Оператор</strong>
            &nbsp;— юридическое лицо, разместившее публичную оферту и
            осуществляющее обработку персональных данных физических лиц
            (Покупателей, Пользователей), осуществивших Заказ на Сайте,
            в целях реализации условий настоящей оферты.<br/>
          <br/>
          <strong>Сайт</strong>
            &nbsp;— официальная веб-страница Продавца на сайте&nbsp;
          <a href="https://example.ru/">https://example.ru/</a><br/>
          <br/>
          <strong>Интернет-магазин</strong>
            &nbsp;— официальный интернет-магазин Продавца по продаже Товаров,
            размещенных на Сайте.<br/>
          <br/>
          <strong>Товары</strong>
            &nbsp;— перечень продукции Продавца, представленный на Сайте.<br/>
          <br/>
          <strong>Заказ&nbsp;</strong>
            — оформленный Покупателем в Интернет-магазине запрос на покупку
            и доставку Товаров, выбранных Покупателем в Интернет-магазине,
            и предоставленный Продавцу посредством сети Интернет
            (электронная форма, размещенная на Сайте) или оформленный
            Покупателем по телефону.<br/>
          <br/>
          <strong>Курьерская служба&nbsp;</strong>
            — лица, оказывающие в интересах Продавца услуги по доставке
            заказанных Покупателем Товаров.<br/>
          <br/>
            Для целей настоящей оферты термины и определения в единственном
            числе относятся также и к терминам и определениям во множественном
            числе и наоборот.<br/>
          <br/>
          <strong>1. Общие положения</strong><br/>
          <br/>
            1.1. В соответствии со статьей 437 Гражданского Кодекса
            Российской Федерации (далее по тексту настоящей оферты — ГК РФ)
            данный документ является публичной офертой, адресованной физическим
            лицам, и в случае принятия изложенных ниже условий, физическое
            лицо обязуется произвести оплату Товара на условиях, изложенных в
            настоящей оферте. В соответствии с пунктом 3 статьи 438 ГК РФ,
            момент окончательного подтверждения Заказа Покупателем является
            акцептом оферты Продавца, что является равносильным заключению
            Договора розничной купли-продажи (далее по тексту настоящей
            оферты — «Договор») Товара на условиях, установленных в настоящей
            оферте и на Сайте.<br/>
          <br/>
            1.2. Продавец и Покупатель гарантируют, что обладают необходимой
            право- и дееспособностью, а также всеми правами и полномочиями,
            необходимыми и достаточными для заключения и исполнения Договора
            розничной купли-продажи Товара.<br/>
          <br/>
            В соответствии с федеральным Законом от 22.11.1995 г. № 171-ФЗ
            «О государственном регулировании производства и оборота этилового
            спирта, алкогольной и спиртосодержащей продукции» лицам, не
            достигшим возраста 18 лет продажа алкогольной продукции запрещена.
            Работники Курьерской службы имеют право потребовать предъявить
            паспорт, либо иной документ, удостоверяющий возраст Покупателя.
            Перечень таких документов устанавливается Постановлением
            Правительства Российской Федерации № 243 от 6 апреля 2011 года и
            на данный момент регулируется Приказом Министерства промышленности
            и торговли Российской Федерации (Минпромторг России) от 15 апреля
            2011 года № 524.<br/>
          <br/>
            1.3. Заказывая Товары через Интернет-магазин, Покупатель
            безоговорочно принимает условия настоящей оферты и соглашается
            с условиями политики конфиденциальности Продавца. Оформленный
            Покупателем на сайте Заказ Товара является подтверждением
            заключенного между Продавцом и Покупателем Договора.<br/>
          <br/>
            1.4. Предложение Продавца/Оператора о продаже товара через
            Интернет-магазин является публичной офертой. Покупатель,
            акцептируя указанную оферту, тем самым осуществляет конклюдентные
            действия, выражающие его волю и согласие на обработку его
            персональных данных, предоставленных при совершении Заказа
            на Сайте Продавца на покупку Товаров.<br/>
          <br/>
            1.5. Согласие Покупателя на обработку его персональных данных,
            полученное в результате совершения действий по оформлению
            Заказа на Сайте, приравнивается собственноручному согласию,
            и (или) согласию, подтвержденному документом ЭЦП.<br/>
          <br/>
            1.6. К отношениям между Покупателем и Продавцом применяются
            положения ГК РФ (в т. ч. положение о розничной купле-продаже
            (глава 30, § 2), закон РФ «О защите прав потребителей»
            от 07.02.1992 г. № 2300-1 и иные нормативно-правовые акты
            действующего законодательства Российской Федерации (далее
            по тексту настоящей оферты — РФ).<br/>
          <br/>
            1.7. Продавец оставляет за собой право вносить изменения в
            настоящую оферту, в связи с чем Покупатель обязуется
            самостоятельно контролировать наличие изменений в настоящей
            оферте, размещенной на Сайте. Уведомление об изменении настоящей
            оферты Продавец обязан разместить на Сайте в виде информационного
            сообщения не позднее, чем за 3 (три) рабочих дня до даты их
            вступления в силу.<br/>
          <br/>
          <strong>2. Предмет Договора</strong><br/>
          <br/>
            2.1. Продавец передает, продает Товары по ценам, представленным
            на Сайте Продавца, а Покупатель производит оплату и принимает
            Товары в соответствии с условиями настоящей оферты.<br/>
          <br/>
            2.2. Право собственности на Товары переходит к Покупателю
            в момент приемки Товаров Покупателем и оплаты последним полной
            стоимости принятых Товаров. Риск случайной гибели или повреждения
            Товаров переходит к Покупателю с момента приемки Товаров
            Покупателем.<br/>
          <br/>
          <strong>3. Права и обязанности Сторон</strong><br/>
          <br/>
            3.1. Продавец обязуется:<br/>
          <br/>
            3.1.1. С момента принятия настоящей оферты обеспечить исполнение
            своих обязательств перед Покупателем на условиях, установленных
            настоящей офертой и в соответствии с требованиями действующего
            законодательства РФ. Продавец оставляет за собой право отказаться
            от исполнения своих обязательств в случае возникновения
            обстоятельств непреодолимой силы («форс-мажор») в соответствии
            с Разделом 8&nbsp;настоящей оферты.<br/>
          <br/>
            3.1.2. Обрабатывать и хранить персональные данные Покупателя,
            предоставленные Продавцу, обеспечивать их конфиденциальность и
            не предоставлять доступ к этой информации третьим лицам, за
            исключением случаев, предусмотренных действующим законодательством
            РФ. Принимая (акцептируя) настоящую оферту, Покупатель подтверждает
            свое согласие и разрешает Оператору обрабатывать свои персональные
            данные, в том числе: фамилию, имя, отчество, адрес доставки,
            телефон. Под обработкой персональных данных в настоящей оферте
            понимается: сбор вышеуказанных данных, их систематизация,
            накопление, хранение, уточнение (обновление, изменение),
            использование, блокирование, уничтожение.<br/>
          <br/>
            3.1.2.1. Оператор имеет право на передачу персональных данных
            Покупателя Курьерской службе с целью доставки Покупателю
            заказанных последним Товаров.<br/>
          <br/>
            3.1.2.2. Оператор имеет право на передачу персональных данных
            Покупателя операторам Контакт-центра, осуществляющих прием
            заказов на Товар, размещенный на Сайте.<br/>
          <br/>
            3.1.2.3. Оператор имеет право назначить лицо, ответственное
            за организацию обработки персональных данных Покупателя,
            в целях реализации положений настоящей оферты.<br/>
          <br/>
            3.1.2.4. Покупатель выражает согласие и разрешает Оператору
            и его службам обрабатывать персональные данные Покупателя с
            помощью автоматизированных систем управления базами данных,
            а также иных программных и технических средств. Работа с такими
            системами осуществляется по вышеуказанному в пункте
            3.1.2 алгоритму (сбор, систематизация, накопление, хранение,
            уточнение, использование, блокирование, уничтожение).<br/>
          <br/>
            3.1.2.5. Оператор вправе самостоятельно определять используемые
            способы обработки персональных данных Покупателя (включая, но,
            не ограничиваясь: автоматическая сверка почтовых кодов с базой
            кодов/индексов, автоматическая проверка написания названий
            улиц/населенных пунктов, сегментация базы данных по заданным
            критериям и т. д.).<br/>
          <br/>
            3.1.2.6. Оператор обеспечивает конфиденциальность предоставленных
            Покупателем персональных данных, их защиту от копирования,
            распространения. В любой момент Покупатель вправе запросить
            перечень своих персональных данных и/или потребовать изменить,
            уничтожить свои персональные данные, позвонив Оператору по
            телефону, указав имя, отчество, фамилию и адрес доставки.<br/>
          <br/>
            3.1.2.7. В соответствии с пунктом 4 статьи 16 федерального закона
            от 27 июля 2006 г. № 149-ФЗ«Об информации, информационных
            технологиях и о защите информации» Продавец обязуется предотвращать
            попытки несанкционированного доступа к персональным данным
            Покупателя, предоставленных Продавцу, своевременно обнаруживать
            и пресекать такие попытки.<br/>
          <br/>
            3.2. Продавец имеет право изменять условия настоящей оферты,
            цены на Товары, указанные в Интернет-магазине, условия оплаты и
            доставки Товаров, способы, сроки и территорию доставки Товаров,
            а также иные условия, указанные в настоящей оферте и на Сайте.<br/>
          <br/>
            3.3. Покупатель обязуется:<br/>
          <br/>
            3.3.1. До момента оформления Заказа на Сайте — ознакомиться с
            содержанием и условиями, установленными в настоящей оферте, а
            также с иными условиями, указанными на Сайте, в том числе с ценами
            на Товары, установленными в Интернет-магазине, зоной доставки
            Товаров и минимальной стоимостью Заказа, который необходимо сделать,
            чтобы он был доставлен Покупателю.<br/>
          <br/>
            3.3.2. Предоставить достоверные персональные данные, необходимые
            для идентификации Покупателя и достаточные для совершения сделки
            с Продавцом и доставки Покупателю заказанных им Товаров.<br/>
          <br/>
            3.3.3. Оплатить заказанные Товары на условиях настоящей оферты.<br/>
          <br/>
            3.3.4. Не использовать Товары, заказанные в Интернет-магазине,
            в предпринимательских целях.<br/>
          <br/>
            3.3.5. Соблюдать условия, установленные в настоящей оферте,
            а также иные условия, указанные на Сайте.<br/>
          <br/>
            3.4. Покупатель имеет право:<br/>
          <br/>
            3.4.1. Использовать Интернет-магазин для оформления Заказа.
            Данные Покупателя, предоставленные при оформлении Заказа,
            являются исключительными и непередаваемыми..<br/>
          <br/>
            3.4.2. На получение информации (рекламных сообщений, рассылку)
            о проводимых акциях в виде смс-сообщений по сетям подвижной
            радиотелефонной связи на указанный при регистрации абонентский
            номер телефона, при условии получения от Покупателя согласия на
            получение информации (рекламы) о проводимых акциях Продавца.
            Пользователь имеет возможность в любой момент отписаться от
            рассылки, а так же подписаться на рассылку вновь.<br/>
          <br/>
          <strong>4. Оформление и сроки выполнения заказа</strong><br/>
          <br/>
            4.1. Заказ Покупателя может быть оформлен по телефону и/или
            посредством заполнения электронной формы Заказа на Сайте.<br/>
          <br/>
            4.1.1. При оформлении Заказа по телефону или посредством
            электронной формы на Сайте, Покупатель тем самым подтверждает,
            что он ознакомлен с условиями настоящей оферты и обязуется
            предоставить Продавцу всю информацию, необходимую для надлежащего
            оформления и исполнения Заказа.<br/>
          <br/>
            4.1.2. При оформлении Заказа через Сайт Покупатель заполняет
            электронную форму Заказа и отправляет сформированный Заказ
            Продавцу путем подтверждения Заказа в электронной форме.<br/>
          <br/>
            4.2. Если на складе Продавца отсутствует необходимое количество
            или ассортимент заказанных Покупателем Товаров, Продавец
            информирует об этом Покупателя по телефону в течение 30 минут
            после получения Заказа от Покупателя. Покупатель вправе
            согласиться принять Товары в ином количестве или ассортименте,
            либо аннулировать свой Заказ. В случае неполучения ответа Покупателя
            Продавец вправе аннулировать Заказ Покупателя в полном объеме.<br/>
          <br/>
            4.3. Покупатель не имеет право изменить состав Заказа.<br/>
          <br/>
            4.4. В случае возникновения у Покупателя дополнительных вопросов,
            касающихся свойств и характеристик Товаров, перед оформлением
            Заказа, Покупатель должен обратиться к Продавцу по телефону
            +7(999)000-99-99 &nbsp;для получения необходимой информации,
            в соответствии с режимом работы, указанным на Сайте.<br/>
          <br/>
          <strong>5. Доставка Товаров</strong><br/>
          <br/>
            5.1. В случае если Товары не были переданы Покупателю по
            вине последнего, отказа Покупателя от приемки и/или оплаты
            заказного им Товара, ложного вызова, Продавец вправе
            заблокировать логин (абонентский номер телефона) Покупателя
            и не принимать от него Заказы.<br/>
          <br/>
            5.2. Доставка Товаров осуществляется Курьерской службой
            по фактическому адресу, указанному Покупателем при оформлении
            Заказа на Интернет-сайте.<br/>
          <br/>
            5.2.1. Доставка Товаров в пределах зоны доставки (зона доставки
            указана на Сайте или может быть уточнена по телефону)
            осуществляется в соответствии с режимом работы, указанным
            на Сайте.<br/>
          <br/>
            5.2.2. Доставка Товаров по адресам, не входящим в зону доставки
            не осуществляется.<br/>
          <br/>
            5.2.3. Продавец приложит все усилия для соблюдения сроков доставки
            Товаров, установленных в настоящей оферте и/или на Сайте. Однако
            задержки в доставке Товаров возможны ввиду непредвиденных
            обстоятельств. При этом под непредвиденными обстоятельствами
            понимаются обстоятельства непреодолимой силы.<br/>
          <br/>
            5.3. Доставка осуществляется при условии, что Покупатель сделает
            Заказ на сумму минимального заказа. Сумма минимального заказа
            определяется Продавцом в одностороннем порядке и указывается на
            Сайте Продавца.<br/>
          <br/>
          <strong>6. Оплата Товаров</strong><br/>
          <br/>
            6.1. Цены на Товары определяются Продавцом в одностороннем порядке
            и указываются на Сайте в российских рублях. Цена Товаров может быть
            изменена Продавцом в одностороннем порядке. При этом цена на
            заказанный Покупателем Товар изменению не подлежит.<br/>
          <br/>
            6.2. Покупатель может заказать только те Товары, которые есть в
            наличии на складе в момент оформления Заказа.<br/>
          <br/>
            6.3. Оплата Товаров Покупателем производится в рублях Российской
            Федерации одним из следующих способов:<br/>
          <br/>
            6.3.1. Наличными денежными средствами:<br/>
          <br/>
            6.3.1.1. Оплата осуществляется по факту получения Товаров,
            подтверждением которой является предоставленный работником
            Курьерской службы кассовый или товарный чек.<br/>
          <br/>
            6.3.1.2. Оплата наличными денежными средствами не ограничена.<br/>
          <br/>
            6.3.2. Безналичным путем, посредством перечисления денежных
            средств на расчетный счет Продавца. Обязательства Покупателя
            по оплате Товара считаются исполненными с момента списания
            соответствующих денежных средств с его лицевого счета.<br/>
          <br/>
          <strong>7. Возврат и обмен Товаров</strong><br/>
          <br/>
            7.1. Продавец обязан передать Покупателю Товары, которые
            полностью соответствуют его Заказу, качество которых
            соответствует информации, представленной Покупателю при
            заключении Договора, а также информации, доведенной до его
            сведения при передаче Товаров (на этикетке или вкладыше,
            прикрепленных к Товарам или их упаковке, либо другими
            способами, предусмотренными для отдельных видов Товаров).<br/>
          <br/>
            7.2. При получении Товаров Покупатель проверяет соответствие
            полученных Товаров Заказу, комплектность и отсутствие претензий
            к внешнему виду доставленного Товаров. В случае получения
            некачественных, некомплектных Товаров либо несоответствия
            полученных Товаров заказанному, Покупатель вправе потребовать
            замены таких Товаров Товарами надлежащего качества сразу в момент
            получения, либо в течение 5 (пяти) минут после получения
            Товаров.&nbsp;<br/>
          <br/>
            7.3. В случае невыполнения условий п. 7.2 настоящей оферты,
            претензии Покупателя по внешнему виду Товаров и их комплектности
            не принимаются.<br/>
          <br/>
          <strong>8. Форс-мажор</strong><br/>
            Любая из Сторон освобождается от ответственности за полное или
            частичное неисполнение своих обязательств по настоящей
            оферте, если это неисполнение было вызвано обстоятельствами
            непреодолимой силы. Обстоятельства непреодолимой силы означают
            чрезвычайные события и обстоятельства, которые Стороны не могли
            ни предвидеть, ни предотвратить разумными средствами. Такие
            чрезвычайныесобытия или обстоятельства включают в себя, в частности:
            забастовки,наводнения, пожары, землетрясения и иные стихийные
            бедствия, войны, военные действия и т. д.<br/>
          <br/>
          <strong>9. Ответственность сторон</strong><br/>
          <br/>
            9.1. За неисполнение или ненадлежащее исполнение условий настоящей
            оферты (акцептованной Покупателем оферты Продавца) Стороны несут
            ответственность в соответствии с законодательством РФ.<br/>
          <br/>
            9.2. Вся текстовая информация и графические изображения,
            размещенные в Интернет-магазине и на Сайте имеют законного
            правообладателя. Незаконное использование указанной информации
            и изображений преследуется в соответствии с действующим
            законодательством РФ. В случае размещения информации и/или
            изображения, взятого с ресурса&nbsp;
          <a href="https://example.ru/">
              https://example.ru/
          </a>, размещение ссылки на ресурс&nbsp;
          <a href="https://example.ru/">
                https://example.ru/
          </a>&nbsp;&nbsp;является обязательным.<br/>
          <br/>
            9.3. Продавец не несет ответственности за ущерб, причиненный
            Покупателю вследствие ненадлежащего использования им Товаров,
            приобретённых в Интернет-магазине.<br/>
          <br/>
            9.4. Продавец не отвечает за убытки Покупателя, возникшие в
            результате неправильного заполнения Заказа, в том числе
            неправильного указания персональных данных.<br/>
          <br/>
            9.5. Покупатель несёт полную ответственность за достоверность
            сведений и персональных данных, указанных им при оформлении
            Заказа в Интернет-магазине.<br/>
          <br/>
            9.6. Пользователь гарантирует, что не будет использовать
            Интернет-магазин и Сайт в иных целях, нежели указанных в
            настоящей оферте.<br/>
          <br/>
            9.7. В случае нарушения Пользователем условий настоящей
            оферты Продавец вправе заблокировать доступ Покупателя к
            использованию Интернет-магазина, путем блокировки логина
            (абонентского номера телефона) Покупателя.<br/>
          <br/>
          <strong>10. Прочие условия</strong><br/>
          <br/>
            10.1. Настоящая оферта вступает в силу с момента совершения
            Покупателем действий, направленных на оформление Заказа на
            Сайте.<br/>
          <br/>
            10.2. Согласие Покупателя на обработку его персональных
            данных действует со дня его оформления Заказа на Сайте до
            дня отзыва согласия, посредством обращения субъекта
            (Пользователя/Покупателя) к Оператору по телефону, с указанием
            при этом своего имени, отчества, фамилии, адреса доставки и
            контактного телефона.<br/>
          <br/>
            10.3. Все споры, связанные с неисполнением или ненадлежащим
            исполнением своих обязательств по настоящему Договору, Стороны
            будут стараться решить путем переговоров.<br/>
          <br/>
            10.4. В случае не достижения согласия в ходе переговоров,
            споры будут разрешаться в судебном порядке в соответствии
            с действующим законодательством РФ.<br/>
          <br/>
          <br/>
          <a href="http://urdata"><strong>11. Реквизиты:</strong></a>
        </p>

        <p>
          <strong>
            Полное наименование
          </strong>
          &nbsp;Индивидуальный предприниматель
          Иванов Иван Иванович
        </p>

        <p><strong>Краткое наименование&nbsp;</strong>ИП Ханипов И.Р.</p>

        <p>
          <strong>Юридический адрес</strong>
        &nbsp;999999, РОССИЯ, НЕБЫВАЛЬСКАЯ ОБЛ., НЕБЫВАЛЬСК Г.,
        ФЕДЮНИНСКОГО УЛ.32/2, КВАРТИРА 1125
        </p>

        <p><strong>ИНН</strong>&nbsp;999999999999</p>

        <p><strong>ОГРН</strong>&nbsp;000555000999333</p>

        <p><strong>Расчетный счет</strong>&nbsp;40802810000555888777</p>

        <p><strong>Банк</strong>&nbsp;
        Ф-Л ЗАПАДНО-СКАЗОЧНЫЙ ПАО БАНК &laquo;СПЁРБАНК&raquo;</p>

        <p><strong>БИК</strong>&nbsp;568978879</p>

        <p><strong>Корреспондентский счет</strong>&nbsp;30101810800000000789</p>
      </div>
    </div>
  );
}

export default PublicOfferPage;
